{"pages":[],"posts":[{"title":"About","text":"一个喜欢呱呱的优秀的杨优秀","link":"/2021/10/28/About/"},{"title":"First Post","text":"老李头 我想和你吃火锅！！！","link":"/2021/10/28/First-Post/"},{"title":"很高兴和你相见--Secrets of the JavaScript Ninja","text":"为什么&lt;script&gt;总是放到最后当DOM渲染遇到script节点时会停止渲染 -&gt; 去加载script。如果此时 ID 为first的元素在script后面，并且此时script需要用到first元素，那么此时脚本就找不到这个元素。 script加载完毕会返回继续渲染DOM节点 script全局变量 It’s important to note that the global state of the JavaScript application persists in the meantime. All user-defined global variables created during the execution of JavaScript code in one script element are normally accessible to JavaScript code in other script elements. This happens because the global window object, which stores all global JavaScript variables, is alive and accessible during the entire lifecycle of the page. 为什么使用匿名函数Just do it! 12345678910var text = &quot;Momo&quot;;function useless(callbackFun) { console.log(&quot;In useless function&quot;); return callbackFun();}//Anonymous functionconsole.log(useless(function (){return text})); Anonymous functions can eliminate the need to pollute the global namespace with unnecessary names when a function isn’t going to be referenced from multiple places within the code.","link":"/2021/11/06/JS%E5%AD%A6%E4%B9%A0%E8%AE%B0%E5%BD%95/"},{"title":"Event","text":"Event JS除了可以影响全局应用程序的状态&amp;&amp;修改DOM，还可以注册事件（Registering event handlers） 当事件被触发时，浏览器就会执行对应的函数 event可以是 来自用户的鼠标点击、敲键盘；或者来自服务器的AJAX请求 所有事件都会被放入一个队列中（按浏览器检测到的先后顺序排列） 事件执行是单线程的，完成一个event -&gt; 出队一个event 浏览器将事件放入队列 这个操作 与 page-building和event-handling这两个阶段无关，也就是将事件放入队列与上述两个阶段可以并行运行(不同的线程) 下面两个阶段就是客户端浏览器运行一个页面的整个周期 page-building 构造DOM节点，遇到script标签则停止构造 去执行JS 当遇到＜/html＞标签时表示此阶段结束 event-handling event-hanling：event loop会轮询队头，如果队头有event，那么就调用相关的 event handler Registering event hanlersThere are two ways to register events 将函数赋值给某个属性：window.onload = function(){}、document.body.onclick = function(){} 使用内建的addEventListener方法：document.body.addEventListener(&quot;事件名，如click/mousemove&quot;, function(){...}) 将某个函数赋值给某个属性以注册事件有一个致命的缺陷：只能赋值一个函数，后赋值的会覆盖之前的 addEventListener方法则可以无限制的给属性注册事件 Summary12graph LR;队列空--&gt;event_loop轮询队头为空--&gt;产生事件--&gt;放入队列--&gt;event_loop轮询找到所有相关的event_handler--&gt;出队列--&gt;执行--&gt;队头为空或执行下一个事件; Exercises What are the two phases in the lifecycle of a client-side web application? What is the main advantage of using the addEventListener method to register an event handler versus assigning a handler to a specific element property? How many events can be processed at once? In what order are events from the event queue processed?","link":"/2021/11/13/Event/"}],"tags":[{"name":"JS","slug":"JS","link":"/tags/JS/"}],"categories":[{"name":"JS","slug":"JS","link":"/categories/JS/"}]}